--------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lhao/Documents/abm_2015/raw_csv_work/Jan16/YearOriDest.log
  log type:  text
 opened on:  11 Jan 2016, 01:21:38

. set more off

. 
. * YearOriDest.do        Jan 2016
. 
. * agents to start with ages 11-44 in 1995 who were 16-49 in 2000 
. * save YearOriDest.dta for individual data for all years 
. * beyond lf ages each year
. * merge in hhid from which get pv20000 (fix the existing spv2000)
. 
. tempfile h t s

. set linesize 255

. 
. *================
. * individual data
. *================
. * hhid 
. use /Users/lhao/Documents/abm_2015/raw_csv_work/Nov15/hhid

. gen pv2000=int(hhid/1000000)

. tab pv2000

     pv2000 |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |     13,297        1.13        1.13
         12 |      9,559        0.81        1.94
         13 |     65,776        5.57        7.51
         14 |     31,831        2.70       10.21
         15 |     22,514        1.91       12.12
         21 |     41,129        3.49       15.60
         22 |     24,873        2.11       17.71
         23 |     33,352        2.83       20.53
         31 |     15,682        1.33       21.86
         32 |     70,201        5.95       27.81
         33 |     44,923        3.81       31.62
         34 |     56,170        4.76       36.38
         35 |     31,754        2.69       39.07
         36 |     34,924        2.96       42.03
         37 |     89,380        7.57       49.60
         41 |     89,696        7.60       57.20
         42 |     51,802        4.39       61.59
         43 |     57,290        4.85       66.45
         44 |     80,683        6.84       73.28
         45 |     41,809        3.54       76.83
         46 |      7,133        0.60       77.43
         50 |     26,687        2.26       79.69
         51 |     74,686        6.33       86.02
         52 |     34,130        2.89       88.91
         53 |     40,835        3.46       92.37
         54 |      2,391        0.20       92.58
         61 |     33,938        2.88       95.45
         62 |     24,291        2.06       97.51
         63 |      4,677        0.40       97.91
         64 |      5,460        0.46       98.37
         65 |     19,238        1.63      100.00
------------+-----------------------------------
      Total |  1,180,111      100.00

. sort pid

. save `h'
file /var/folders/cw/h5v47mrn1z33fvhn64b3dd1h0000gn/T//S_01290.000001 saved

. 
. use /Users/lhao/Documents/abm_2015/raw_csv_work/Nov15/csv1_d2

. keep pid provhk spv* rup* age male edyr 

. 
. * exclude 13 individuals migrated before 1995 & age<16 in 1995 (age<21 in 2000)
. tab rup1995 if age<21

    rup1995 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     42,167       99.97       99.97
          2 |          7        0.02       99.99
          3 |          6        0.01      100.00
------------+-----------------------------------
      Total |     42,180      100.00

. drop if (rup1995==2 | rup1995==3) & age<21
(13 observations deleted)

. 
. * age range 16-49 in 2000, i.e., 11-44 in1995
. keep if age>=16 & age<=49
(71,723 observations deleted)

. sum age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    313,342    32.04913    9.260309         16         49

. 
. sort pid

. merge 1:1 pid using `h'

    Result                           # of obs.
    -----------------------------------------
    not matched                       866,769
        from master                         0  (_merge==1)
        from using                    866,769  (_merge==2)

    matched                           313,342  (_merge==3)
    -----------------------------------------

. drop if _merge==2
(866,769 observations deleted)

. drop _merge

. ren pv2000 spvcheck

. ren provhk spvhk

. # delimit ;
delimiter now ;
. recode spvcheck spvhk
> (       11      =       1       )
> (       12      =       2       )
> (       13      =       3       )
> (       14      =       4       )
> (       15      =       5       )
> (       21      =       6       )
> (       22      =       7       )
> (       23      =       8       )
> (       31      =       9       )
> (       32      =       10      )
> (       33      =       11      )
> (       34      =       12      )
> (       35      =       13      )
> (       36      =       14      )
> (       37      =       15      )
> (       41      =       16      )
> (       42      =       17      )
> (       43      =       18      )
> (       44      =       19      )
> (       45      =       20      )
> (       46      =       21      )
> (       50      =       22      )
> (       51      =       23      )
> (       52      =       24      )
> (       53      =       25      )
> (       54      =       26      )
> (       61      =       27      )
> (       62      =       28      )
> (       63      =       29      )
> (       64      =       30      )
> (       65      =       31      )
> ;
(spvcheck: 313342 changes made)
(spvhk: 313342 changes made)

. # delimit cr
delimiter now cr
. tab1 spvcheck spvhk

-> tabulation of spvcheck  

   spvcheck |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,940        0.62        0.62
          2 |      1,140        0.36        0.98
          3 |     19,936        6.36        7.35
          4 |      8,251        2.63        9.98
          5 |      5,172        1.65       11.63
          6 |      7,844        2.50       14.13
          7 |      5,343        1.71       15.84
          8 |      6,637        2.12       17.96
          9 |      1,919        0.61       18.57
         10 |     16,585        5.29       23.86
         11 |     11,813        3.77       27.63
         12 |     15,948        5.09       32.72
         13 |      8,905        2.84       35.56
         14 |      9,231        2.95       38.51
         15 |     24,015        7.66       46.17
         16 |     28,066        8.96       55.13
         17 |     12,395        3.96       59.09
         18 |     16,800        5.36       64.45
         19 |     22,104        7.05       71.50
         20 |     11,876        3.79       75.29
         21 |      1,578        0.50       75.80
         22 |      6,472        2.07       77.86
         23 |     20,484        6.54       84.40
         24 |     10,247        3.27       87.67
         25 |     14,331        4.57       92.24
         26 |        866        0.28       92.52
         27 |      8,956        2.86       95.38
         28 |      7,225        2.31       97.68
         29 |      1,247        0.40       98.08
         30 |      1,296        0.41       98.49
         31 |      4,720        1.51      100.00
------------+-----------------------------------
      Total |    313,342      100.00

-> tabulation of spvhk  

province of |
      hukou |
registratio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        916        0.29        0.29
          2 |        937        0.30        0.59
          3 |     20,134        6.43        7.02
          4 |      8,131        2.59        9.61
          5 |      5,166        1.65       11.26
          6 |      7,660        2.44       13.71
          7 |      5,403        1.72       15.43
          8 |      6,701        2.14       17.57
          9 |        623        0.20       17.77
         10 |     16,269        5.19       22.96
         11 |     10,246        3.27       26.23
         12 |     17,906        5.71       31.94
         13 |      8,269        2.64       34.58
         14 |     11,176        3.57       38.15
         15 |     24,132        7.70       45.85
         16 |     29,535        9.43       55.28
         17 |     13,841        4.42       59.69
         18 |     19,233        6.14       65.83
         19 |     12,626        4.03       69.86
         20 |     13,138        4.19       74.05
         21 |      1,535        0.49       74.54
         23 |     30,844        9.84       84.39
         24 |     10,931        3.49       87.88
         25 |     13,925        4.44       92.32
         26 |        834        0.27       92.59
         27 |      9,216        2.94       95.53
         28 |      7,370        2.35       97.88
         29 |      1,228        0.39       98.27
         30 |      1,263        0.40       98.67
         31 |      4,154        1.33      100.00
------------+-----------------------------------
      Total |    313,342      100.00

. 
. tab rup1995

    rup1995 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |    312,911       99.86       99.86
          2 |        267        0.09       99.95
          3 |        164        0.05      100.00
------------+-----------------------------------
      Total |    313,342      100.00

. 
. forval i=1995/2000 {
  2. ren rup`i' mig`i'
  3. recode mig`i' 1=0 2 3=1
  4. la var mig`i' "migration status 1 yes 0 no"
  5. }
(mig1995: 313342 changes made)
(mig1996: 313342 changes made)
(mig1997: 313342 changes made)
(mig1998: 313342 changes made)
(mig1999: 313342 changes made)
(mig2000: 313342 changes made)

. 
. save `t', replace
(note: file /var/folders/cw/h5v47mrn1z33fvhn64b3dd1h0000gn/T//S_01290.000002 not found)
file /var/folders/cw/h5v47mrn1z33fvhn64b3dd1h0000gn/T//S_01290.000002 saved

. d

Contains data from /var/folders/cw/h5v47mrn1z33fvhn64b3dd1h0000gn/T//S_01290.000002
  obs:       313,342                          
 vars:            19                          11 Jan 2016 01:21
 size:    10,026,944                          
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
pid             double  %10.0f                personal ID = hhid+individual ID (R1)
male            byte    %8.0g                 1=male 0=female
age             byte    %8.0g                 age
edyr            byte    %9.0g                 years of schooling
spvhk           byte    %9.0g                 province of hukou registration
spv1995         byte    %9.0g                 
spv1996         byte    %9.0g                 
spv1997         byte    %9.0g                 
spv1998         byte    %9.0g                 
spv1999         byte    %9.0g                 
spv2000         byte    %9.0g                 
mig1995         byte    %9.0g                 migration status 1 yes 0 no
mig1996         byte    %9.0g                 migration status 1 yes 0 no
mig1997         byte    %9.0g                 migration status 1 yes 0 no
mig1998         byte    %9.0g                 migration status 1 yes 0 no
mig1999         byte    %9.0g                 migration status 1 yes 0 no
mig2000         byte    %9.0g                 migration status 1 yes 0 no
hhid            long    %12.0g                household ID=province+district+hhnumber
spvcheck        float   %9.0g                 
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         pid |    313,342    3.88e+09    1.32e+09   1.10e+09   6.59e+09
        male |    313,342    .5819296    .4932426          0          1
         age |    313,342    32.04913    9.260309         16         49
        edyr |    313,342    7.784233     2.07412          4         14
       spvhk |    313,342    15.85719    7.136419          1         31
-------------+---------------------------------------------------------
     spv1995 |    313,342    15.60167    6.815129          1         30
     spv1996 |    313,342    15.59825    6.819721          1         30
     spv1997 |    313,342    15.59314    6.825559          1         30
     spv1998 |    313,342    15.58548    6.833652          1         30
     spv1999 |    313,342    15.55982    6.848029          1         30
-------------+---------------------------------------------------------
     spv2000 |    313,342    15.50785    6.884956          1         30
     mig1995 |    313,342    .0013755    .0370622          0          1
     mig1996 |    313,342    .0073753    .0855626          0          1
     mig1997 |    313,342    .0160336    .1256048          0          1
     mig1998 |    313,342     .030229     .171217          0          1
-------------+---------------------------------------------------------
     mig1999 |    313,342     .058326    .2343593          0          1
     mig2000 |    313,342    .0994026    .2992022          0          1
        hhid |    313,342    3.88e+07    1.32e+07   1.10e+07   6.59e+07
    spvcheck |    313,342    15.72924    7.177779          1         31

. 
. *==========================
. * spv and spvhk consistence
. * spvcheck in 2000 has 31 provinces (chongqing and sichuan)
. tab spv2000 spvcheck if spvcheck<16

           |                                                                               spvcheck
   spv2000 |         1          2          3          4          5          6          7          8          9         10         11         12         13         14         15 |     Total
-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
         1 |     1,940          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     1,940 
         2 |         0      1,140          0          0          0          0          0          0          0          0          0          0          0          0          0 |     1,140 
         3 |         0          0     19,936          0          0          0          0          0          0          0          0          0          0          0          0 |    19,936 
         4 |         0          0          0      8,251          0          0          0          0          0          0          0          0          0          0          0 |     8,251 
         5 |         0          0          0          0      5,172          0          0          0          0          0          0          0          0          0          0 |     5,172 
         6 |         0          0          0          0          0      7,844          0          0          0          0          0          0          0          0          0 |     7,844 
         7 |         0          0          0          0          0          0      5,343          0          0          0          0          0          0          0          0 |     5,343 
         8 |         0          0          0          0          0          0          0      6,637          0          0          0          0          0          0          0 |     6,637 
         9 |         0          0          0          0          0          0          0          0      1,919          0          0          0          0          0          0 |     1,919 
        10 |         0          0          0          0          0          0          0          0          0     16,585          0          0          0          0          0 |    16,585 
        11 |         0          0          0          0          0          0          0          0          0          0     11,813          0          0          0          0 |    11,813 
        12 |         0          0          0          0          0          0          0          0          0          0          0     15,948          0          0          0 |    15,948 
        13 |         0          0          0          0          0          0          0          0          0          0          0          0      8,905          0          0 |     8,905 
        14 |         0          0          0          0          0          0          0          0          0          0          0          0          0      9,231          0 |     9,231 
        15 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0     24,015 |    24,015 
-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |     1,940      1,140     19,936      8,251      5,172      7,844      5,343      6,637      1,919     16,585     11,813     15,948      8,905      9,231     24,015 |   144,679 


. tab spv2000 spvcheck if spvcheck>=16

           |                                                                                    spvcheck
   spv2000 |        16         17         18         19         20         21         22         23         24         25         26         27         28         29         30         31 |     Total
-----------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
        16 |    28,066          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |    28,066 
        17 |         0     12,395          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |    12,395 
        18 |         0          0     16,800          0          0          0          0          0          0          0          0          0          0          0          0          0 |    16,800 
        19 |         0          0          0     22,104          0          0          0          0          0          0          0          0          0          0          0          0 |    22,104 
        20 |         0          0          0          0     11,876          0          0          0          0          0          0          0          0          0          0          0 |    11,876 
        21 |         0          0          0          0          0      1,578          0          0          0          0          0          0          0          0          0          0 |     1,578 
        22 |         0          0          0          0          0          0      6,472     20,484          0          0          0          0          0          0          0          0 |    26,956 
        23 |         0          0          0          0          0          0          0          0     10,247          0          0          0          0          0          0          0 |    10,247 
        24 |         0          0          0          0          0          0          0          0          0     14,331          0          0          0          0          0          0 |    14,331 
        25 |         0          0          0          0          0          0          0          0          0          0        866          0          0          0          0          0 |       866 
        26 |         0          0          0          0          0          0          0          0          0          0          0      8,956          0          0          0          0 |     8,956 
        27 |         0          0          0          0          0          0          0          0          0          0          0          0      7,225          0          0          0 |     7,225 
        28 |         0          0          0          0          0          0          0          0          0          0          0          0          0      1,247          0          0 |     1,247 
        29 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0      1,296          0 |     1,296 
        30 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0      4,720 |     4,720 
-----------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |    28,066     12,395     16,800     22,104     11,876      1,578      6,472     20,484     10,247     14,331        866      8,956      7,225      1,247      1,296      4,720 |   168,663 


. 
. * fix spv2000
. drop spv2000

. ren spvcheck spv2000

. 
. 
. * migrants in stock of each year
. gen m1995=mig1995

. egen m1996=rowmax(mig1995 mig1996)

. egen m1997=rowmax(mig1995 mig1996 mig1997)

. egen m1998=rowmax(mig1995 mig1996 mig1997 mig1998)

. egen m1999=rowmax(mig1995 mig1996 mig1997 mig1998 mig1999)

. egen m2000=rowmax(mig1995 mig1996 mig1997 mig1998 mig1999 mig2000)

. tab1 m1995-m2000

-> tabulation of m1995  

      m1995 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    312,911       99.86       99.86
          1 |        431        0.14      100.00
------------+-----------------------------------
      Total |    313,342      100.00

-> tabulation of m1996  

      m1996 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    311,031       99.26       99.26
          1 |      2,311        0.74      100.00
------------+-----------------------------------
      Total |    313,342      100.00

-> tabulation of m1997  

      m1997 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    308,318       98.40       98.40
          1 |      5,024        1.60      100.00
------------+-----------------------------------
      Total |    313,342      100.00

-> tabulation of m1998  

      m1998 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    303,870       96.98       96.98
          1 |      9,472        3.02      100.00
------------+-----------------------------------
      Total |    313,342      100.00

-> tabulation of m1999  

      m1999 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    295,066       94.17       94.17
          1 |     18,276        5.83      100.00
------------+-----------------------------------
      Total |    313,342      100.00

-> tabulation of m2000  

      m2000 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    282,195       90.06       90.06
          1 |     31,147        9.94      100.00
------------+-----------------------------------
      Total |    313,342      100.00

. 
. * fix spvhk of nonmigrants
. replace spvhk=spv2000 if m2000==0
(6,059 real changes made)

. save `t', replace
file /var/folders/cw/h5v47mrn1z33fvhn64b3dd1h0000gn/T//S_01290.000002 saved

. 
. * break up spvhk=23 if m2000=1
. keep if m2000==1 & spvhk==23
(308,133 observations deleted)

. sort pid

. gen random=runiform()

. sort random

. replace spvhk=22 if random<=.2365
(1,220 real changes made)

. drop random

. save `s'
file /var/folders/cw/h5v47mrn1z33fvhn64b3dd1h0000gn/T//S_01290.000003 saved

. use `t', clear

. drop if m2000==1 & spvhk==23
(5,209 observations deleted)

. append using `s'

. tab spvhk

province of |
      hukou |
registratio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        916        0.29        0.29
          2 |        937        0.30        0.59
          3 |     20,134        6.43        7.02
          4 |      8,131        2.59        9.61
          5 |      5,166        1.65       11.26
          6 |      7,660        2.44       13.71
          7 |      5,403        1.72       15.43
          8 |      6,701        2.14       17.57
          9 |        623        0.20       17.77
         10 |     16,269        5.19       22.96
         11 |     10,246        3.27       26.23
         12 |     17,906        5.71       31.94
         13 |      8,269        2.64       34.58
         14 |     11,176        3.57       38.15
         15 |     24,132        7.70       45.85
         16 |     29,535        9.43       55.28
         17 |     13,841        4.42       59.69
         18 |     19,233        6.14       65.83
         19 |     12,626        4.03       69.86
         20 |     13,138        4.19       74.05
         21 |      1,535        0.49       74.54
         22 |      7,279        2.32       76.87
         23 |     23,565        7.52       84.39
         24 |     10,931        3.49       87.88
         25 |     13,925        4.44       92.32
         26 |        834        0.27       92.59
         27 |      9,216        2.94       95.53
         28 |      7,370        2.35       97.88
         29 |      1,228        0.39       98.27
         30 |      1,263        0.40       98.67
         31 |      4,154        1.33      100.00
------------+-----------------------------------
      Total |    313,342      100.00

. 
. * fix spv1995 - spv1999 (5 years)
. forval i=1995/2000 {
  2.   replace spv`i'=spvhk if m`i'==0
  3.   replace spv`i'=spv2000 if m`i'==1
  4. }
(72,392 real changes made)
(63 real changes made)
(72,022 real changes made)
(287 real changes made)
(71,450 real changes made)
(627 real changes made)
(70,528 real changes made)
(1,173 real changes made)
(68,556 real changes made)
(2,138 real changes made)
(0 real changes made)
(0 real changes made)

. tab1 spv1995 spv1996 spv1997 spv1998 spv1999 spv2000

-> tabulation of spv1995  

    spv1995 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        929        0.30        0.30
          2 |        941        0.30        0.60
          3 |     20,130        6.42        7.02
          4 |      8,132        2.60        9.62
          5 |      5,165        1.65       11.26
          6 |      7,665        2.45       13.71
          7 |      5,401        1.72       15.43
          8 |      6,702        2.14       17.57
          9 |        647        0.21       17.78
         10 |     16,269        5.19       22.97
         11 |     10,244        3.27       26.24
         12 |     17,892        5.71       31.95
         13 |      8,266        2.64       34.59
         14 |     11,163        3.56       38.15
         15 |     24,123        7.70       45.85
         16 |     29,526        9.42       55.27
         17 |     13,828        4.41       59.69
         18 |     19,210        6.13       65.82
         19 |     12,731        4.06       69.88
         20 |     13,116        4.19       74.07
         21 |      1,537        0.49       74.56
         22 |      7,270        2.32       76.88
         23 |     23,523        7.51       84.38
         24 |     10,930        3.49       87.87
         25 |     13,934        4.45       92.32
         26 |        837        0.27       92.59
         27 |      9,212        2.94       95.53
         28 |      7,363        2.35       97.88
         29 |      1,228        0.39       98.27
         30 |      1,265        0.40       98.67
         31 |      4,163        1.33      100.00
------------+-----------------------------------
      Total |    313,342      100.00

-> tabulation of spv1996  

    spv1996 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        995        0.32        0.32
          2 |        958        0.31        0.62
          3 |     20,111        6.42        7.04
          4 |      8,133        2.60        9.64
          5 |      5,163        1.65       11.28
          6 |      7,675        2.45       13.73
          7 |      5,394        1.72       15.46
          8 |      6,699        2.14       17.59
          9 |        726        0.23       17.83
         10 |     16,281        5.20       23.02
         11 |     10,276        3.28       26.30
         12 |     17,804        5.68       31.98
         13 |      8,265        2.64       34.62
         14 |     11,060        3.53       38.15
         15 |     24,112        7.70       45.85
         16 |     29,479        9.41       55.25
         17 |     13,767        4.39       59.65
         18 |     19,086        6.09       65.74
         19 |     13,225        4.22       69.96
         20 |     13,042        4.16       74.12
         21 |      1,536        0.49       74.61
         22 |      7,246        2.31       76.92
         23 |     23,351        7.45       84.38
         24 |     10,906        3.48       87.86
         25 |     13,961        4.46       92.31
         26 |        839        0.27       92.58
         27 |      9,199        2.94       95.52
         28 |      7,357        2.35       97.86
         29 |      1,229        0.39       98.26
         30 |      1,265        0.40       98.66
         31 |      4,202        1.34      100.00
------------+-----------------------------------
      Total |    313,342      100.00

-> tabulation of spv1997  

    spv1997 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,071        0.34        0.34
          2 |        988        0.32        0.66
          3 |     20,094        6.41        7.07
          4 |      8,146        2.60        9.67
          5 |      5,165        1.65       11.32
          6 |      7,679        2.45       13.77
          7 |      5,396        1.72       15.49
          8 |      6,691        2.14       17.63
          9 |        823        0.26       17.89
         10 |     16,296        5.20       23.09
         11 |     10,296        3.29       26.38
         12 |     17,672        5.64       32.02
         13 |      8,292        2.65       34.66
         14 |     10,926        3.49       38.15
         15 |     24,101        7.69       45.84
         16 |     29,371        9.37       55.21
         17 |     13,665        4.36       59.57
         18 |     18,913        6.04       65.61
         19 |     14,029        4.48       70.09
         20 |     12,937        4.13       74.22
         21 |      1,538        0.49       74.71
         22 |      7,176        2.29       77.00
         23 |     23,101        7.37       84.37
         24 |     10,873        3.47       87.84
         25 |     13,999        4.47       92.31
         26 |        842        0.27       92.58
         27 |      9,164        2.92       95.50
         28 |      7,342        2.34       97.84
         29 |      1,230        0.39       98.24
         30 |      1,270        0.41       98.64
         31 |      4,256        1.36      100.00
------------+-----------------------------------
      Total |    313,342      100.00

-> tabulation of spv1998  

    spv1998 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,198        0.38        0.38
          2 |      1,003        0.32        0.70
          3 |     20,066        6.40        7.11
          4 |      8,152        2.60        9.71
          5 |      5,164        1.65       11.36
          6 |      7,697        2.46       13.81
          7 |      5,394        1.72       15.53
          8 |      6,689        2.13       17.67
          9 |      1,013        0.32       17.99
         10 |     16,329        5.21       23.20
         11 |     10,410        3.32       26.53
         12 |     17,417        5.56       32.08
         13 |      8,319        2.65       34.74
         14 |     10,688        3.41       38.15
         15 |     24,078        7.68       45.83
         16 |     29,150        9.30       55.14
         17 |     13,489        4.30       59.44
         18 |     18,563        5.92       65.37
         19 |     15,422        4.92       70.29
         20 |     12,779        4.08       74.37
         21 |      1,547        0.49       74.86
         22 |      7,074        2.26       77.12
         23 |     22,691        7.24       84.36
         24 |     10,809        3.45       87.81
         25 |     14,082        4.49       92.30
         26 |        851        0.27       92.57
         27 |      9,130        2.91       95.49
         28 |      7,320        2.34       97.82
         29 |      1,232        0.39       98.22
         30 |      1,273        0.41       98.62
         31 |      4,313        1.38      100.00
------------+-----------------------------------
      Total |    313,342      100.00

-> tabulation of spv1999  

    spv1999 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,466        0.47        0.47
          2 |      1,055        0.34        0.80
          3 |     20,004        6.38        7.19
          4 |      8,189        2.61        9.80
          5 |      5,159        1.65       11.45
          6 |      7,731        2.47       13.92
          7 |      5,378        1.72       15.63
          8 |      6,665        2.13       17.76
          9 |      1,394        0.44       18.20
         10 |     16,408        5.24       23.44
         11 |     10,769        3.44       26.88
         12 |     16,897        5.39       32.27
         13 |      8,496        2.71       34.98
         14 |     10,155        3.24       38.22
         15 |     24,041        7.67       45.89
         16 |     28,700        9.16       55.05
         17 |     13,100        4.18       59.23
         18 |     17,793        5.68       64.91
         19 |     18,413        5.88       70.79
         20 |     12,442        3.97       74.76
         21 |      1,556        0.50       75.26
         22 |      6,837        2.18       77.44
         23 |     21,811        6.96       84.40
         24 |     10,604        3.38       87.78
         25 |     14,166        4.52       92.30
         26 |        862        0.28       92.58
         27 |      9,045        2.89       95.47
         28 |      7,283        2.32       97.79
         29 |      1,237        0.39       98.19
         30 |      1,274        0.41       98.59
         31 |      4,412        1.41      100.00
------------+-----------------------------------
      Total |    313,342      100.00

-> tabulation of spv2000  

    spv2000 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,940        0.62        0.62
          2 |      1,140        0.36        0.98
          3 |     19,936        6.36        7.35
          4 |      8,251        2.63        9.98
          5 |      5,172        1.65       11.63
          6 |      7,844        2.50       14.13
          7 |      5,343        1.71       15.84
          8 |      6,637        2.12       17.96
          9 |      1,919        0.61       18.57
         10 |     16,585        5.29       23.86
         11 |     11,813        3.77       27.63
         12 |     15,948        5.09       32.72
         13 |      8,905        2.84       35.56
         14 |      9,231        2.95       38.51
         15 |     24,015        7.66       46.17
         16 |     28,066        8.96       55.13
         17 |     12,395        3.96       59.09
         18 |     16,800        5.36       64.45
         19 |     22,104        7.05       71.50
         20 |     11,876        3.79       75.29
         21 |      1,578        0.50       75.80
         22 |      6,472        2.07       77.86
         23 |     20,484        6.54       84.40
         24 |     10,247        3.27       87.67
         25 |     14,331        4.57       92.24
         26 |        866        0.28       92.52
         27 |      8,956        2.86       95.38
         28 |      7,225        2.31       97.68
         29 |      1,247        0.40       98.08
         30 |      1,296        0.41       98.49
         31 |      4,720        1.51      100.00
------------+-----------------------------------
      Total |    313,342      100.00

. 
. * check spv2000 within-hhid consistence
. * spvhk are consistent for the majority (spouses could have different spvhk)
. sort hhid

. gen gapspv=spv2000-spv2000[_n-1] if hhid==hhid[_n-1] & hhid<.
(168,155 missing values generated)

. gen gapspvhk=spvhk-spvhk[_n-1] if hhid==hhid[_n-1] & hhid<.
(168,155 missing values generated)

. tab1 gapspv gapspvhk

-> tabulation of gapspv  

     gapspv |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    145,187      100.00      100.00
------------+-----------------------------------
      Total |    145,187      100.00

-> tabulation of gapspvhk  

   gapspvhk |      Freq.     Percent        Cum.
------------+-----------------------------------
        -30 |          1        0.00        0.00
        -27 |          2        0.00        0.00
        -24 |          6        0.00        0.01
        -23 |          1        0.00        0.01
        -22 |          2        0.00        0.01
        -20 |         10        0.01        0.02
        -19 |          3        0.00        0.02
        -18 |          7        0.00        0.02
        -17 |         15        0.01        0.03
        -16 |          8        0.01        0.04
        -15 |         18        0.01        0.05
        -14 |         26        0.02        0.07
        -13 |         53        0.04        0.10
        -12 |         57        0.04        0.14
        -11 |         64        0.04        0.19
        -10 |         83        0.06        0.25
         -9 |        131        0.09        0.34
         -8 |        100        0.07        0.40
         -7 |        154        0.11        0.51
         -6 |        243        0.17        0.68
         -5 |        294        0.20        0.88
         -4 |        376        0.26        1.14
         -3 |        296        0.20        1.34
         -2 |        419        0.29        1.63
         -1 |        964        0.66        2.30
          0 |    138,527       95.41       97.71
          1 |        965        0.66       98.37
          2 |        426        0.29       98.67
          3 |        280        0.19       98.86
          4 |        343        0.24       99.10
          5 |        302        0.21       99.30
          6 |        242        0.17       99.47
          7 |        153        0.11       99.58
          8 |         87        0.06       99.64
          9 |        158        0.11       99.74
         10 |         68        0.05       99.79
         11 |         87        0.06       99.85
         12 |         67        0.05       99.90
         13 |         67        0.05       99.94
         14 |         18        0.01       99.96
         15 |         14        0.01       99.97
         16 |          9        0.01       99.97
         17 |         10        0.01       99.98
         18 |          7        0.00       99.98
         19 |          6        0.00       99.99
         20 |          4        0.00       99.99
         22 |          3        0.00       99.99
         23 |          1        0.00       99.99
         24 |          5        0.00      100.00
         25 |          3        0.00      100.00
         27 |          1        0.00      100.00
         30 |          1        0.00      100.00
------------+-----------------------------------
      Total |    145,187      100.00

. drop gapspv gapspvhk

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         pid |    313,342    3.88e+09    1.32e+09   1.10e+09   6.59e+09
        male |    313,342    .5819296    .4932426          0          1
         age |    313,342    32.04913    9.260309         16         49
        edyr |    313,342    7.784233     2.07412          4         14
       spvhk |    313,342    15.83396    7.114725          1         31
-------------+---------------------------------------------------------
     spv1995 |    313,342    15.83291    7.115668          1         31
     spv1996 |    313,342    15.82902    7.119863          1         31
     spv1997 |    313,342    15.82316    7.125066          1         31
     spv1998 |    313,342    15.81431    7.132108          1         31
     spv1999 |    313,342    15.78543     7.14382          1         31
-------------+---------------------------------------------------------
     mig1995 |    313,342    .0013755    .0370622          0          1
     mig1996 |    313,342    .0073753    .0855626          0          1
     mig1997 |    313,342    .0160336    .1256048          0          1
     mig1998 |    313,342     .030229     .171217          0          1
     mig1999 |    313,342     .058326    .2343593          0          1
-------------+---------------------------------------------------------
     mig2000 |    313,342    .0994026    .2992022          0          1
        hhid |    313,342    3.88e+07    1.32e+07   1.10e+07   6.59e+07
     spv2000 |    313,342    15.72924    7.177779          1         31
       m1995 |    313,342    .0013755    .0370622          0          1
       m1996 |    313,342    .0073753    .0855626          0          1
-------------+---------------------------------------------------------
       m1997 |    313,342    .0160336    .1256048          0          1
       m1998 |    313,342     .030229     .171217          0          1
       m1999 |    313,342     .058326    .2343593          0          1
       m2000 |    313,342    .0994026    .2992022          0          1

. 
. * scramble Pid
. * no missing id
. sum hhid pid

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        hhid |    313,342    3.88e+07    1.32e+07   1.10e+07   6.59e+07
         pid |    313,342    3.88e+09    1.32e+09   1.10e+09   6.59e+09

. sort spvhk mig1995

. gen Pid=_n

. sort hhid

. save `t', replace
file /var/folders/cw/h5v47mrn1z33fvhn64b3dd1h0000gn/T//S_01290.000002 saved

. 
. * scramble Hid
. keep hhid

. sort hhid

. keep if hhid!=hhid[_n-1]
(145,187 observations deleted)

. sort hhid

. gen Hid=_n

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        hhid |    168,155    3.88e+07    1.32e+07   1.10e+07   6.59e+07
         Hid |    168,155       84078    48542.31          1     168155

. sort hhid

. merge 1:m hhid using `t'

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           313,342  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. * disregard Hid of migrants in 2000 stock
. replace Hid=. if m2000==1
(31,147 real changes made, 31,147 to missing)

. 
. * save wide-form data
. saveold YearOriDest, replace
(saving in Stata 13 format)
(FYI, saveold has options version(12) and version(11) that write files in older Stata formats)
file YearOriDest.dta saved

. d

Contains data from YearOriDest.dta
  obs:       313,342                          
 vars:            26                          11 Jan 2016 01:21
 size:    19,740,546                          
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
hhid            long    %12.0g                household ID=province+district+hhnumber
Hid             float   %9.0g                 
pid             double  %10.0f                personal ID = hhid+individual ID (R1)
male            byte    %8.0g                 1=male 0=female
age             byte    %8.0g                 age
edyr            byte    %9.0g                 years of schooling
spvhk           byte    %9.0g                 province of hukou registration
spv1995         byte    %9.0g                 
spv1996         byte    %9.0g                 
spv1997         byte    %9.0g                 
spv1998         byte    %9.0g                 
spv1999         byte    %9.0g                 
mig1995         byte    %9.0g                 migration status 1 yes 0 no
mig1996         byte    %9.0g                 migration status 1 yes 0 no
mig1997         byte    %9.0g                 migration status 1 yes 0 no
mig1998         byte    %9.0g                 migration status 1 yes 0 no
mig1999         byte    %9.0g                 migration status 1 yes 0 no
mig2000         byte    %9.0g                 migration status 1 yes 0 no
spv2000         float   %9.0g                 
m1995           float   %9.0g                 
m1996           float   %9.0g                 
m1997           float   %9.0g                 
m1998           float   %9.0g                 
m1999           float   %9.0g                 
m2000           float   %9.0g                 
Pid             float   %9.0g                 
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: 

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        hhid |    313,342    3.88e+07    1.32e+07   1.10e+07   6.59e+07
         Hid |    282,195    84135.95    48917.21        304     168154
         pid |    313,342    3.88e+09    1.32e+09   1.10e+09   6.59e+09
        male |    313,342    .5819296    .4932426          0          1
         age |    313,342    32.04913    9.260309         16         49
-------------+---------------------------------------------------------
        edyr |    313,342    7.784233     2.07412          4         14
       spvhk |    313,342    15.83396    7.114725          1         31
     spv1995 |    313,342    15.83291    7.115668          1         31
     spv1996 |    313,342    15.82902    7.119863          1         31
     spv1997 |    313,342    15.82316    7.125066          1         31
-------------+---------------------------------------------------------
     spv1998 |    313,342    15.81431    7.132108          1         31
     spv1999 |    313,342    15.78543     7.14382          1         31
     mig1995 |    313,342    .0013755    .0370622          0          1
     mig1996 |    313,342    .0073753    .0855626          0          1
     mig1997 |    313,342    .0160336    .1256048          0          1
-------------+---------------------------------------------------------
     mig1998 |    313,342     .030229     .171217          0          1
     mig1999 |    313,342     .058326    .2343593          0          1
     mig2000 |    313,342    .0994026    .2992022          0          1
     spv2000 |    313,342    15.72924    7.177779          1         31
       m1995 |    313,342    .0013755    .0370622          0          1
-------------+---------------------------------------------------------
       m1996 |    313,342    .0073753    .0855626          0          1
       m1997 |    313,342    .0160336    .1256048          0          1
       m1998 |    313,342     .030229     .171217          0          1
       m1999 |    313,342     .058326    .2343593          0          1
       m2000 |    313,342    .0994026    .2992022          0          1
-------------+---------------------------------------------------------
         Pid |    313,342    156671.5    90454.19          1     313342

. 
. *==========================
. * aging, assuming no deaths
. gen age1999=age-1

. gen age1998=age-2

. gen age1997=age-3

. gen age1996=age-4

. gen age1995=age-5

. ren age age2000

. sum age*

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     age2000 |    313,342    32.04913    9.260309         16         49
     age1999 |    313,342    31.04913    9.260309         15         48
     age1998 |    313,342    30.04913    9.260309         14         47
     age1997 |    313,342    29.04913    9.260309         13         46
     age1996 |    313,342    28.04913    9.260309         12         45
-------------+---------------------------------------------------------
     age1995 |    313,342    27.04913    9.260309         11         44

. 
. * long form
. reshape long age spv m mig, i(Pid) j(year) 
(note: j = 1995 1996 1997 1998 1999 2000)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                   313342   -> 1.9e+06
Number of variables                  31   ->      12
j variable (6 values)                     ->   year
xij variables:
            age1995 age1996 ... age2000   ->   age
            spv1995 spv1996 ... spv2000   ->   spv
                  m1995 m1996 ... m2000   ->   m
            mig1995 mig1996 ... mig2000   ->   mig
-----------------------------------------------------------------------------

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         Pid |  1,880,052    156671.5    90454.07          1     313342
        year |  1,880,052      1997.5    1.707826       1995       2000
        hhid |  1,880,052    3.88e+07    1.32e+07   1.10e+07   6.59e+07
         Hid |  1,693,170    84135.95    48917.14        304     168154
         pid |  1,880,052    3.88e+09    1.32e+09   1.10e+09   6.59e+09
-------------+---------------------------------------------------------
        male |  1,880,052    .5819296     .493242          0          1
         age |  1,880,052    29.54913    9.416462         11         49
        edyr |  1,880,052    7.784233    2.074118          4         14
       spvhk |  1,880,052    15.83396    7.114715          1         31
         mig |  1,880,052     .035457    .1849319          0          1
-------------+---------------------------------------------------------
         spv |  1,880,052    15.80235     7.13583          1         31
           m |  1,880,052     .035457    .1849319          0          1

. sort Hid Pid

. save `t', replace
file /var/folders/cw/h5v47mrn1z33fvhn64b3dd1h0000gn/T//S_01290.000002 saved

. 
. *=====================
. * InitialAgentData.csv
. *=====================
. * 1995 micro data, including ages 11-15 nonmigrants
. keep if year==1995
(1,566,710 observations deleted)

. keep if age<45
(0 observations deleted)

. keep Hid Pid spv spvhk age male edyr m

. order Hid Pid spv spvhk age male edyr m

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         Hid |    282,195    84135.95    48917.21        304     168154
         Pid |    313,342    156671.5    90454.19          1     313342
         spv |    313,342    15.83291    7.115668          1         31
       spvhk |    313,342    15.83396    7.114725          1         31
         age |    313,342    27.04913    9.260309         11         44
-------------+---------------------------------------------------------
        male |    313,342    .5819296    .4932426          0          1
        edyr |    313,342    7.784233     2.07412          4         14
           m |    313,342    .0013755    .0370622          0          1

. tab m

          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    312,911       99.86       99.86
          1 |        431        0.14      100.00
------------+-----------------------------------
      Total |    313,342      100.00

. tab spvhk spv if spv<16 & m==1

  province |
  of hukou |
registrati |                                                                                 spv
        on |         1          2          3          4          5          6          7          8          9         10         11         12         13         14         15 |     Total
-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
         3 |         3          2          3          0          0          0          0          0          0          0          0          0          0          0          0 |         8 
         4 |         0          0          0          4          0          0          0          0          0          0          0          0          0          0          0 |         4 
         5 |         0          0          0          0          5          1          0          0          0          0          0          0          0          0          0 |         6 
         6 |         0          0          0          0          0          2          0          0          0          0          0          0          0          0          0 |         2 
         7 |         0          0          0          0          0          2          1          0          0          0          0          0          0          0          0 |         3 
         8 |         0          0          0          0          0          0          1          3          0          0          0          0          0          0          0 |         4 
        10 |         0          0          0          0          0          0          0          0          7         13          0          0          0          0          0 |        20 
        11 |         0          0          0          0          0          0          0          0          4          3         24          2          2          0          0 |        35 
        12 |         0          0          0          1          0          2          0          0          7          1          1          3          2          0          0 |        17 
        13 |         0          0          1          0          0          0          0          0          4          0          0          0         11          0          2 |        18 
        14 |         0          0          0          0          0          0          0          0          1          0          4          0          1          3          0 |         9 
        15 |         2          0          0          0          0          0          0          2          0          4          0          0          0          0          5 |        13 
        16 |         1          0          0          0          0          0          0          0          0          0          0          0          0          0          1 |         2 
        17 |         0          1          0          0          0          0          0          0          0          0          3          0          0          0          0 |         4 
        18 |         2          0          0          0          0          0          0          0          0          1          2          0          0          0          0 |         5 
        22 |         0          0          0          0          0          0          0          0          0          0          1          0          0          0          0 |         1 
        23 |         3          1          0          0          0          0          0          0          0          0          2          0          0          0          0 |         6 
        24 |         0          0          0          0          0          0          0          0          1          0          0          0          0          0          0 |         1 
        27 |         1          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |         1 
        28 |         1          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |         1 
-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |        13          4          4          5          5          7          2          5         24         22         37          5         16          3          8 |       160 


. tab spvhk spv if spv>=16 & m==1

  province |
  of hukou |
registrati |                                                                                 spv
        on |        16         17         18         19         20         21         22         23         24         25         26         27         28         30         31 |     Total
-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
         7 |         0          0          0          1          0          0          0          0          0          0          0          0          0          0          0 |         1 
        10 |         0          0          0          2          0          0          0          0          0          0          0          0          0          0          0 |         2 
        11 |         0          0          0          0          0          0          0          0          0          2          0          0          0          0          2 |         4 
        12 |         0          0          0          2          0          0          0          0          0          0          0          0          0          0          0 |         2 
        13 |         0          0          0          1          0          0          0          0          0          0          0          0          0          0          0 |         1 
        14 |         0          0          1          6          0          0          0          0          0          0          0          0          0          0          0 |         7 
        15 |         0          0          0          2          0          0          0          0          0          0          0          0          0          0          2 |         4 
        16 |        10          0          0          7          0          0          0          0          0          0          0          1          0          0          1 |        19 
        17 |         0         13          0          8          0          0          0          0          0          0          0          0          0          0          1 |        22 
        18 |         0          0          8         14          4          0          0          0          1          0          0          0          0          0          0 |        27 
        19 |         0          0          0         46          0          0          0          0          0          0          0          0          0          0          0 |        46 
        20 |         0          0          0         24          7          2          0          0          0          0          0          0          0          0          0 |        33 
        22 |         0          0          0          7          0          0          3          6          0          2          0          0          0          0          0 |        18 
        23 |         0          0          0         26          0          0          7         16          1          5          2          0          0          0          1 |        58 
        24 |         0          0          0          2          0          0          0          0          2          0          0          0          0          0          0 |         4 
        25 |         0          0          0          0          0          0          0          0          0          5          0          0          0          0          0 |         5 
        27 |         2          0          0          0          0          0          0          0          0          0          0          4          0          2          0 |         8 
        28 |         0          0          0          3          0          0          0          0          0          0          1          0          2          0          2 |         8 
        31 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          2 |         2 
-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |        12         13          9        151         11          2         10         22          4         14          3          5          2          2         11 |       271 


. 
. ren age Age

. ren male Male

. ren edyr YearOfEduc

. ren m Migrated

. ren Hid FamilyId

. ren Pid PersonId

. 
. outsheet PersonId spv spvhk Age Male YearOfEduc Migrated FamilyId using InitialAgentData.csv, comma name replace

. 
. *====================
. * EndingAgentData.csv
. *====================
. use `t', clear

. * 2000 micro data
. keep if year==2000
(1,566,710 observations deleted)

. keep if age>=16 & age<=44
(40,443 observations deleted)

. keep Hid Pid spv spvhk age male edyr m

. order Hid Pid spv spvhk age male edyr m

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         Hid |    242,745    84469.13     49090.4        304     168154
         Pid |    272,899      157456    90581.75          1     313342
         spv |    272,899    15.77587       7.197          1         31
       spvhk |    272,899    15.89445    7.127677          1         31
         age |    272,899    29.84927    7.789717         16         44
-------------+---------------------------------------------------------
        male |    272,899     .578617    .4937816          0          1
        edyr |    272,899    7.939256    2.025573          4         14
           m |    272,899    .1104951    .3135064          0          1

. tab m

          m |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    242,745       88.95       88.95
          1 |     30,154       11.05      100.00
------------+-----------------------------------
      Total |    272,899      100.00

. tab spvhk spv if spv<16 & m==1

  province |
  of hukou |
registrati |                                                                                 spv
        on |         1          2          3          4          5          6          7          8          9         10         11         12         13         14         15 |     Total
-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
         1 |        31          1          0          0          0          0          0          0          0          0          0          0          0          0          0 |        32 
         2 |         3         16          0          0          0          0          0          0          0          0          0          0          0          0          0 |        19 
         3 |       298         34        225         16          8          4          2          3          4          4          6          0          1          2          8 |       615 
         4 |        21          3         10        182         18          0          0          0          0          0          0          0          0          0          2 |       236 
         5 |        15          2         14         11        257         21          3          2          0          0          0          0          0          0          4 |       329 
         6 |        14          1          2          0          3        239          3          5          1          1          0          0          0          0          1 |       270 
         7 |         7          4          6          2          3         31         76         19          1          0          0          0          5          0          8 |       162 
         8 |         6         12          8          0         10         54          4        191          1          1          5          0          0          0         12 |       304 
         9 |         0          0          0          0          0          0          0          0         20          0          0          0          0          0          0 |        20 
        10 |        56         10          1          3          2          6         17          5        283        801         58          8          8          1         16 |     1,275 
        11 |        20          8         11         14          1          8          0          2        115         64        899         12         31          2         13 |     1,200 
        12 |        85         18         28          5          1         34          5          0        479        456        477        229         87          0         27 |     1,931 
        13 |         8          0          3          1          2          3          4          0         47         24         17          3        803          5          3 |       923 
        14 |        11          2          0          1          0          4          0          2         59         31        497          3        299        224          4 |     1,137 
        15 |        75         49         17         11          1         14          2          8         22         12         16          0          8          0        775 |     1,010 
        16 |       148         29         45         54          3         14          4          3         50         63        139          2         20          1         68 |       643 
        17 |        48         16         35         10          2         11          4          9         27         44        133          5         82          2         15 |       443 
        18 |         5          0          3          0          1          1          0          0         14         16        125          2         39          9          1 |       216 
        19 |         5          0          4          0          0          0          0          0          3          1          2          0          1          2          5 |        23 
        20 |         0          0          0          0          0          0          0          0          1          3         20          0          5          3          0 |        32 
        22 |        26          2         11          9          1          3          0          1         22         46         90          0         70          0          3 |       284 
        23 |        80          8         27         38          5         10          0          0         85        133        277          0        216          0         26 |       905 
        24 |         4          1          0          2          0          1          0          1          6         30        169          1         72          3          1 |       291 
        25 |         1          0          0          1          0          0          0          0          2          2         23          0          4          0          0 |        33 
        27 |        18          4          0         10         13          0          0          0          4          7         21          0          9          0          7 |        93 
        28 |        25          1          2          0          8          0          0          0          3          5          1          0          1          0          1 |        47 
        29 |         0          0          0          0          1          0          0          0          0          0          0          0          0          0          0 |         1 
        31 |         7          0          1          0          0          0          0          0          4          0          0          0          0          0          0 |        12 
-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |     1,017        221        453        370        340        458        124        251      1,253      1,744      2,975        265      1,761        254      1,000 |    12,486 


. tab spvhk spv if spv>=16 & m==1

  province |
  of hukou |
registrati |                                                                                       spv
        on |        16         17         18         19         20         21         22         23         24         25         26         27         28         29         30         31 |     Total
-----------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
         1 |         0          0          0          0          0          0          0          0          0          1          0          0          0          0          0          0 |         1 
         2 |         0          0          0          2          0          0          0          1          0          0          0          0          0          0          0          0 |         3 
         3 |         5          1          0          9          2          0          0          2          0          2          0          0          2          0          1          0 |        24 
         4 |         8          0          1          1          0          0          0          1          0          0          0          3          0          0          0          3 |        17 
         5 |         0          0          0          1          0          0          0          0          0          0          0          0          2          0          0          0 |         3 
         6 |         0          1          0          8          0          0          0          0          0          0          0          1          0          0          0          0 |        10 
         7 |         0          2          0          8          0          0          0          0          0          0          0          0          0          0          0          5 |        15 
         8 |         0          0          0          6          0          0          0          2          0          0          0          0          0          0          0          0 |         8 
        10 |        12          3          2         84          0          0          1          0          0          7          0          2          1          3          0         29 |       144 
        11 |        13         20          7         77         12          0          1         17          7         36          1          6         10          0          4         14 |       225 
        12 |         4         12          4        182          5          2          0          2          0          1          0          4          3          2          2         18 |       241 
        13 |         2          0          8        149          5          0          7          1          2         19          1          1          3          2          0          1 |       201 
        14 |         2          6         15        977          5          9          1          2          5          7          0          2          0          0          2          5 |     1,038 
        15 |        12          1          0         73          0          1          0          2          3          2          0          2          2          0          3         10 |       111 
        16 |       310         23          2        753          0          1          2          3          0          6          1          5          4          3          5         88 |     1,206 
        17 |        20        526         20        924          7          5          7          0          2         26          0         16          4          3          1         57 |     1,618 
        18 |         5         10        415      2,112         57         10          3          3         17         30          2          3          0          0          1         15 |     2,683 
        19 |         0          3          1      2,203          2          7          0          1          0          9          0          0          0          0          0          0 |     2,226 
        20 |         0          1          2      1,321        396         20          0          0          0         10          0          0          0          0          0          3 |     1,753 
        21 |         0          0          0         26          0         43          0          0          0          0          0          0          0          0          0          0 |        69 
        22 |         0         10          5        437         11          2        106        220         10         49          6          5          0          0          0         39 |       900 
        23 |         6         25          4      1,645         16          5        262        587         32        169         18         17          8          6          5        150 |     2,955 
        24 |         0          2          4        380         12          1          1          1        244         70          0          0          0          0          0          0 |       715 
        25 |         0          0          0         21          6          0          0          5          0        479          1          0          0          0          0          0 |       512 
        26 |         0          0          0          4          0          0          0          0          0          0         13          0          0          0          0          0 |        17 
        27 |        12          0          1        177          0          0          0          5          0          2          2        253          7          2          4         26 |       491 
        28 |         1          0          0         39          0          0          0          1          0          1          3          4        163          9         15         78 |       314 
        29 |         0          0          0          1          0          0          0          0          0          0          1          0          1         22          0          8 |        33 
        30 |         1          0          0          1          0          0          0          0          0          0          0          0          1          0         42          8 |        53 
        31 |         0          0          0          2          1          0          0          0          0          0          0          0          0          0          1         78 |        82 
-----------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |       413        646        491     11,623        537        106        391        856        322        926         49        324        211         52         86        635 |    17,668 


. 
. ren age Age

. ren male Male

. ren edyr YearOfEduc

. ren m Migrated

. ren Hid FamilyId

. ren Pid PersonId

. 
. outsheet PersonId spv spvhk Age Male YearOfEduc Migrated FamilyId using EndingAgentData.csv, comma name replace

. 
. *=====================
. * YearOriDestCount.csv
. *=====================
. use `t', clear

. * 6 years aggregates
. keep if age>=16 & age<=44
(238,196 observations deleted)

. keep year spv spvhk m

. bys year spvhk spv: egen MigCount=total(m)

. sort year spvhk spv

. drop if year==year[_n-1] & spvhk==spvhk[_n-1] & spv==spv[_n-1]
(1,639,973 observations deleted)

. outsheet year spvhk spv MigCount using YearOriDestCount.csv, comma name replace 
(note: file YearOriDestCount.csv not found)

. 
. * annual mig counts check
. bys year: egen ym=total(MigCount)

. sort year

. list year ym if year!=year[_n-1], sep(0)

      +--------------+
      | year      ym |
      |--------------|
   1. | 1995     431 |
 106. | 1996    2233 |
 323. | 1997    4839 |
 608. | 1998    9129 |
 961. | 1999   17650 |
1383. | 2000   30154 |
      +--------------+

. 
. log close
      name:  <unnamed>
       log:  /Users/lhao/Documents/abm_2015/raw_csv_work/Jan16/YearOriDest.log
  log type:  text
 closed on:  11 Jan 2016, 01:22:09
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
